LIMPIEZA DATOS CSV:

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

In [2]:
df = pd.read_csv(r"C:\Users\Usuario\Documents\Curso_analisis_datos\Modulo_3\Proyecto/hr_raw_data.csv", index_col=0) # cargo el archivo CSV

display(df.head())# muestra las 5 primeras filas

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,...,20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,...,33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,...,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,...,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,...,19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

In [3]:
# Identificar valores nulos: hay varias columnas con valores Nan, hay que ver que columnas tienen esos valores y tomar decisiones.
df.isnull().sum()

age                            0
attrition                      0
businesstravel               801
dailyrate                      0
department                  1366
distancefromhome               0
education                      0
educationfield               774
employeecount                  0
employeenumber                 0
environmentsatisfaction        0
gender                         0
hourlyrate                  1267
jobinvolvement                 0
joblevel                       0
jobrole                        0
jobsatisfaction                0
maritalstatus                675
monthlyincome                489
monthlyrate                    0
numcompaniesworked             0
over18                       938
overtime                     696
percentsalaryhike              0
performancerating            200
relationshipsatisfaction       0
standardhours                351
stockoptionlevel               0
totalworkingyears            549
trainingtimeslastyear          0
worklifebalance              114
yearsatcompany                 0
yearsincurrentrole          1643
yearssincelastpromotion        0
yearswithcurrmanager           0
sameasmonthlyincome          489
datebirth                      0
salary                       285
roledepartament             1366
numberchildren              1678
remotework                     0
dtype: int64

In [4]:
# para ver porcentaje de valores numos en cada columna:

(df.isnull().sum() / len(df)) * 100

age                           0.000000
attrition                     0.000000
businesstravel               47.735399
dailyrate                     0.000000
department                   81.406436
distancefromhome              0.000000
education                     0.000000
educationfield               46.126341
employeecount                 0.000000
employeenumber                0.000000
environmentsatisfaction       0.000000
gender                        0.000000
hourlyrate                   75.506555
jobinvolvement                0.000000
joblevel                      0.000000
jobrole                       0.000000
jobsatisfaction               0.000000
maritalstatus                40.226460
monthlyincome                29.141836
monthlyrate                   0.000000
numcompaniesworked            0.000000
over18                       55.899881
overtime                     41.477950
percentsalaryhike             0.000000
performancerating            11.918951
relationshipsatisfaction      0.000000
standardhours                20.917759
stockoptionlevel              0.000000
totalworkingyears            32.717521
trainingtimeslastyear         0.000000
worklifebalance               6.793802
yearsatcompany                0.000000
yearsincurrentrole           97.914184
yearssincelastpromotion       0.000000
yearswithcurrmanager          0.000000
sameasmonthlyincome          29.141836
datebirth                     0.000000
salary                       16.984505
roledepartament              81.406436
numberchildren              100.000000
remotework                    0.000000
dtype: float64

Eliminar columnas con demasiados nulos (>80%)
Si una columna tiene más del 80% de valores nulos, lo mejor es eliminarla, porque tiene poca información útil.
Columnas para  eliminar:
- "department" (81.40%)
- "roledepartament" (81.40%)
- "numberchildren" (100%)
- "yearsincurrentrole" (97.91%)

In [5]:
df.drop(columns=["department", "roledepartament", "numberchildren", "yearsincurrentrole"], inplace=True)

In [6]:
df.head() # vemos que hay 37 columnas ahora, se han eliminado bien.

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,...,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,remotework
0,51,No,NaN,2015.722222,6,3,NaN,1,1,1,...,NaN,5,"3,0",20,15,15,"16280,83$",1972,"195370,00$",Yes
1,52,No,NaN,2063.388889,1,4,Life Sciences,1,2,3,...,"34,0",5,"3,0",33,11,9,NaN,1971,"199990,00$",1
2,42,No,travel_rarely,1984.253968,4,2,Technical Degree,1,3,3,...,"22,0",3,NaN,22,11,15,NaN,1981,"192320,00$",1
3,47,No,travel_rarely,1771.404762,2,4,Medical,1,4,1,...,NaN,2,NaN,20,5,6,"14307,50$",1976,"171690,00$",False
4,46,No,NaN,1582.771346,3,3,Technical Degree,1,5,1,...,NaN,5,"3,0",19,2,8,"12783,92$",1977,NaN,0

In [7]:
df.dtypes[["businesstravel", "educationfield","maritalstatus" , "overtime", "performancerating" , "hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary", "totalworkingyears"]]

businesstravel          object
educationfield          object
maritalstatus           object
overtime                object
performancerating       object
hourlyrate             float64
monthlyincome           object
over18                  object
standardhours           object
worklifebalance         object
sameasmonthlyincome     object
salary                  object
totalworkingyears       object
dtype: object

Cambiar datos NaN a Null: 
Chatgpt
pd.notna(df[col]) es una función de Pandas que nos ayuda a identificar qué valores NO son NaN dentro de una columna. 

¿Qué hace pd.notna(df[col])?

Esta función devuelve un array de valores True o False, donde:
✅ True → Significa que el valor NO es NaN (es decir, hay un dato válido).
❌ False → Significa que el valor ES NaN (es decir, falta información).

In [8]:
#  transformar esta columna en formato INT.

df["performancerating"] = df["performancerating"].astype(str).str.replace(",", ".").astype(float)

# .astype(str) -> Convierte todos los valores en texto.
# .str.replace(",", ".") -> Reemplaza las comas por puntos.
# .astype(float) -> Convierte la columna a número

In [9]:
df["performancerating"].dtype

dtype('float64')

In [10]:
df["performancerating"].head()

0    3.0
1    3.0
2    3.0
3    3.0
4    3.0
Name: performancerating, dtype: float64

In [11]:
# para una sola columna seria:

df["salary"] = df["salary"].where(pd.notna(df["salary"]), None)

# Explicación del código:
#  pd.notna(df["salary"]) detecta los valores no nulos (True) y los valores NaN (False).
#  .where(pd.notna(df["salary"]), None) mantiene los valores True (no NaN) y reemplaza los False (NaN) con None.

In [12]:
df["salary"].isnull().sum()

np.int64(285)

In [13]:
# reviso la columna y ya esta cambiado NaN por None.

df["salary"].sample(10)

529      53914,11$
1348     24790,00$
177           None
482      67120,00$
1345     21210,00$
1541    153407,07$
283      28111,13$
83      100071,84$
1382    182650,00$
1603     28111,13$
Name: salary, dtype: object

In [14]:
# Voy a cambiar los datos NaN que dan error en SQL por None en las columnas que faltan.

columnas_a_convertir = ["businesstravel", "educationfield","maritalstatus" , "overtime", "performancerating" , "hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary", "totalworkingyears"]
for col in columnas_a_convertir:
    df[col] = df[col].where(pd.notna(df[col]), None)

# pd.notna(df[col]) -> Detecta los valores que no son NaN.
# .where(...) -> Mantiene los valores correctos y reemplaza los NaN con None.

In [15]:
df[["hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary","totalworkingyears"]].sample(10)

,hourlyrate,monthlyincome,over18,standardhours,worklifebalance,sameasmonthlyincome,salary,totalworkingyears
724,NaN,"2342,59$",Y,None,"3,0","2342,59$",None,"8,0"
727,177.021825,"11438,33$",None,Full Time,"3,0","11438,33$","137260,00$",None
1325,NaN,"2245,00$",Y,Part Time,"3,0","2245,00$","26940,00$",None
613,NaN,"4492,84$",None,Part Time,"2,0","4492,84$","53914,11$","9,0"
1416,226.558532,None,Y,Full Time,"1,0",None,"175670,00$","27,0"
646,NaN,"4492,84$",None,Part Time,"3,0","4492,84$","53914,11$",None
469,69.532083,None,None,Part Time,"3,0",None,"53914,11$","7,0"
557,NaN,None,None,Full Time,"1,0",None,"129360,00$","25,0"
629,NaN,None,None,Part Time,"1,0",None,"28111,13$","12,0"
1258,NaN,None,Y,Part Time,"2,0",None,"28111,13$","9,0"

Siguientes pasos:

- hay simbolo $ en valores de columna de precios o sueldos, mejor quitarlo y poner el $ en el nombre de la columna.
- hay textos escritos con errores tipograficos 
- hay textos escritos diferentes, con mayusculas o minusculas.
- hay espacios delante o detras en algunos OBJECTS.
- cambiar gender de 0-1 a Male o Female.

# Posibilidad de Rellenar valores nulos con datos adecuados

Algunas columnas tienen nulos moderados (10-50%), se puede rellenar con valores adecuados.
-> Posibles opciones de relleno:
"businesstravel" -> Rellenar con "No Travel" (si el nulo significa que no viajan).
"educationfield" -> Rellenar con "Unknown" si no conocemos el campo de estudio.
"maritalstatus" -> Rellenar con "Single" (opción estándar si faltan datos).
"overtime" -> Rellenar con "No" (asumiendo que el nulo significa que no hacen horas extra).
"performancerating" -> Rellenar con la media o mediana o poner none

In [16]:
df.info () # para saber el tipo de datos que hay en cada columna

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 37 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   object
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   distancefromhome          1678 non-null   int64
 5   education                 1678 non-null   int64
 6   educationfield            904 non-null    object
 7   employeecount             1678 non-null   int64
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   int64
 11  hourlyrate                411 non-null    float64
 12  jobinvolvement            1678 non-null   int64
 13  joblevel                  1678 non-null   int64
 14  jobrole                   1678 non-null   object
 15  jobsatisfaction           1678 non-null   int64
 16  maritalstatus             1003 non-null   object
 17  monthlyincome             1189 non-null   object
 18  monthlyrate               1678 non-null   object
 19  numcompaniesworked        1678 non-null   int64
 20  over18                    740 non-null    object
 21  overtime                  982 non-null    object
 22  percentsalaryhike         1678 non-null   int64
 23  performancerating         1478 non-null   float64
 24  relationshipsatisfaction  1678 non-null   int64
 25  standardhours             1327 non-null   object
 26  stockoptionlevel          1678 non-null   int64
 27  totalworkingyears         1129 non-null   object
 28  trainingtimeslastyear     1678 non-null   int64
 29  worklifebalance           1564 non-null   object
 30  yearsatcompany            1678 non-null   int64
 31  yearssincelastpromotion   1678 non-null   int64
 32  yearswithcurrmanager      1678 non-null   int64
 33  sameasmonthlyincome       1189 non-null   object
 34  datebirth                 1678 non-null   int64
 35  salary                    1393 non-null   object
 36  remotework                1678 non-null   object
dtypes: float64(3), int64(18), object(16)
memory usage: 498.2+ KB

In [17]:
df_numerico = df.select_dtypes(include=['int', 'float']) # sacar las columnas numericas con las que tengo que trabajar
df_numerico

,dailyrate,distancefromhome,education,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,...,numcompaniesworked,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,trainingtimeslastyear,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth
0,2015.722222,6,3,1,1,1,0,NaN,3,5,...,7,13,3.0,3,0,5,20,15,15,1972
1,2063.388889,1,4,1,2,3,0,NaN,2,5,...,0,14,3.0,1,1,5,33,11,9,1971
2,1984.253968,4,2,1,3,3,0,NaN,3,5,...,1,11,3.0,4,0,3,22,11,15,1981
3,1771.404762,2,4,1,4,1,1,NaN,3,4,...,3,19,3.0,2,2,2,20,5,6,1976
4,1582.771346,3,3,1,5,1,1,NaN,4,4,...,2,12,3.0,4,1,5,19,2,8,1977
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1673,488.944444,-26,3,1,824,2,1,NaN,4,1,...,4,12,3.0,4,0,2,3,1,2,1980
1674,1973.984127,26,4,1,1087,4,1,NaN,3,5,...,3,11,3.0,3,1,2,5,1,0,1976
1675,290.035510,15,3,1,528,3,0,NaN,3,1,...,1,19,3.0,1,0,1,6,1,5,1994
1676,1032.487286,4,3,1,76,3,1,NaN,2,3,...,8,12,NaN,3,1,4,22,14,10,1976
1677,556.256661,2,2,1,401,4,1,69.532083,3,2,...,4,14,3.0,4,0,2,8,0,7,1991

In [18]:
df['gender'] = df['gender'].replace({0: 'male', 1:"female"}) #cambiar valores de la columna de gender

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 37 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   object
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   distancefromhome          1678 non-null   int64
 5   education                 1678 non-null   int64
 6   educationfield            904 non-null    object
 7   employeecount             1678 non-null   int64
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  hourlyrate                411 non-null    float64
 12  jobinvolvement            1678 non-null   int64
 13  joblevel                  1678 non-null   int64
 14  jobrole                   1678 non-null   object
 15  jobsatisfaction           1678 non-null   int64
 16  maritalstatus             1003 non-null   object
 17  monthlyincome             1189 non-null   object
 18  monthlyrate               1678 non-null   object
 19  numcompaniesworked        1678 non-null   int64
 20  over18                    740 non-null    object
 21  overtime                  982 non-null    object
 22  percentsalaryhike         1678 non-null   int64
 23  performancerating         1478 non-null   float64
 24  relationshipsatisfaction  1678 non-null   int64
 25  standardhours             1327 non-null   object
 26  stockoptionlevel          1678 non-null   int64
 27  totalworkingyears         1129 non-null   object
 28  trainingtimeslastyear     1678 non-null   int64
 29  worklifebalance           1564 non-null   object
 30  yearsatcompany            1678 non-null   int64
 31  yearssincelastpromotion   1678 non-null   int64
 32  yearswithcurrmanager      1678 non-null   int64
 33  sameasmonthlyincome       1189 non-null   object
 34  datebirth                 1678 non-null   int64
 35  salary                    1393 non-null   object
 36  remotework                1678 non-null   object
dtypes: float64(3), int64(17), object(17)
memory usage: 498.2+ KB

In [20]:
df = df.where(df_numerico <0, None) #cambia los valores negativos por none

In [21]:
df = df.replace('', None).where(pd.notna(df), None) # reemplaza los valores vacios y los NaN (not a number) por none

In [22]:
df['hourlrate'] = df['hourlyrate'].round(2) # modificar columna dailyrate para que los valores se queden con solo 2 decimales
df['dailyrate'] = df['dailyrate'].round(2)

In [23]:
df

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,...,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,remotework,hourlrate
0,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
1,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
2,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
3,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
4,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1673,None,None,None,NaN,-26.0,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
1674,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
1675,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
1676,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN
1677,None,None,None,NaN,NaN,NaN,None,NaN,NaN,NaN,...,NaN,None,NaN,NaN,NaN,None,NaN,None,None,NaN